uhnp/src/Catalogs/ТрудовыеФункции/ТрудовыеФункции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТрудовыеФункции</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДАВТ</name>
      <description>Договор авторского заказа</description>
    </items>
    <items>
      <name>ДАВТФЛНС</name>
      <description>Договор авторского заказа, страхование от несчастных случаев</description>
    </items>
    <items>
      <name>ДГПХ</name>
      <description>Договор ГПХ о выполнении работ (оказании услуг)</description>
    </items>
    <items>
      <name>ДГПХФЛНС</name>
      <description>Договор ГПХ о выполнении работ (оказании услуг), страхование от несчастных случаев</description>
    </items>
    <items>
      <name>ДОИП</name>
      <description>Договор об отчуждении исключительного права на произведения науки, литературы, искусства</description>
    </items>
    <items>
      <name>ИЗЛД</name>
      <description>Издательский лицензионный договор</description>
    </items>
    <items>
      <name>ЛДПИ</name>
      <description>Лицензионный договор о предоставлении права использования произведения науки, литературы, искусства</description>
    </items>
  </predefined>
  <attributes>
    <name>КодПрофессиональнойДеятельности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКЗ</name>
    <type>
      <types>CatalogRef.КлассификаторЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТРКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТРКЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТРКатегория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТРКодСтатистика</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКЗСтатистика</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТР2026Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТР2026Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКЗ2026</name>
    <type>
      <types>CatalogRef.КлассификаторЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПДТРКатегорияСтатистика</name>
    <comment>АПК:58 различия имени и синонима оправданы длиной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ТрудовыеФункции/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Предопределенный Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("КодПоОКЗ"));
	Иначе
		
		Если ОбщегоНазначения.ТекущаяДатаПользователя() < ЭлектронныеТрудовыеКнижкиКлиентСервер.ДатаВсутпленияВСилуОКПДТР2026() Тогда
			ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("КодПоОКЗ2026"));
		Иначе
			ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("КодПоОКЗ"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодПрофессиональнойДеятельности) Тогда
			Если СтрДлина(СокрЛП(КодПрофессиональнойДеятельности)) < 10 Тогда 
				ОбщегоНазначения.СообщитьПользователю(
					Нстр("ru = 'Неверно заполнен Код профессиональной деятельности - недостаточно символов.';
						|en = 'Incorrect Professional activity code - not enough characters.'"), 
					ЭтотОбъект, "КодПрофессиональнойДеятельности", , Отказ);
			ИначеЕсли Не ЗначениеЗаполнено(Сред(КодПрофессиональнойДеятельности, 8, 1))
				Или (Не СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Сред(КодПрофессиональнойДеятельности, 8, 1))
				И Не СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(Сред(КодПрофессиональнойДеятельности, 8, 1))) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					Нстр("ru = 'Неверно заполнен Код профессиональной деятельности - восьмым символом должна быть буква.';
						|en = 'Incorrect Professional activity code - a letter must be the eighth character.'"), 
					ЭтотОбъект, "КодПрофессиональнойДеятельности", , Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
